tests/testdata/customer_orders/myapp/04_all_item_types_with_pre_made_discount.json

{
    "version": "0.1",
    "test_p": 0,
    "external_order_reference_nr": null,
    "order_placement_channel_id": 1,
    "order_notes": "I want food ASAP!!",
    "payment_point_id": null,
    "payment_details": {
        "payable_amount": 104.3,
        "tip_amount": 0,
        "discount_amount": 44.7,
        "tax_amount": 0,
        "currency_name": "aed",
        "payment_method_name": "unknown",
        "paid_p": 0
    },
    "integration_details": {
        "branch_id": 7,
        "brand_id": 1,
        "facility_id": 1,
        "marketplace_id": 9,
        "fulfillment_type": "restaurant-delivery"
    },
    "customer_details": {
        "customer_id": 1
    },
    "customer_address_details": {
        "customer_address_id": 1
    },
    "employee_details": {
        "external_employee_id": "1ee11",
        "first_name_en": null,
        "last_name_en": null,
        "email": "merchant_employee@gmail.com",
        "phone_nr": null
    },
    "item_list": [
        {
            "external_item_id": "pb_048351",
            "display_name_en": "Potato Bun",
            "display_name_ar": "",
            "price": 4,
            "quantity": 1,
            "modifier_section_list": []
        },
        {
            "external_item_id": "cc_145095",
            "display_name_en": "Coca Cola",
            "display_name_ar": "",
            "price": 8,
            "quantity": 1,
            "modifier_section_list": []
        },
        {
            "external_item_id": "c_203315",
            "display_name_en": "Coleslaw",
            "display_name_ar": "",
            "price": 11,
            "quantity": 1,
            "modifier_section_list": []
        },
        {
            "external_item_id": "bbd_536569",
            "display_name_en": "Burger & Brisket Duo",
            "display_name_ar": "",
            "price": 47,
            "quantity": 2,
            "modifier_section_list": [
                {
                    "external_modifier_section_id": "miac_253390",
                    "display_section_name_en": "Make it a Combo?",
                    "display_section_name_ar": "",
                    "modifier_choice_list": [
                        {
                            "external_modifier_choice_id": "fc_467412",
                            "display_choice_name_en": "Fries & Coke",
                            "display_choice_name_ar": "",
                            "price": 16,
                            "quantity": 1
                        }
                    ]
                },
                {
                    "external_modifier_section_id": "c_687701",
                    "display_section_name_en": "Customize:",
                    "display_section_name_ar": "",
                    "modifier_choice_list": [
                        {
                            "external_modifier_choice_id": "no_011080",
                            "display_choice_name_en": "No onions",
                            "display_choice_name_ar": "",
                            "price": 0,
                            "quantity": 2
                        }
                    ]
                }
            ]
        }
    ],
    "offer_list": [],
    "discount_list": [{
        "discount_id": 1,
        "item_id": null,
        "percentage_p": 1,
        "discount_value": null,
        "discount_cap_value": null,
        "minimum_order_value": null
    }]
}