tests/testdata/payment_link_generation_payload/b2binpay/correct/01_menu_items_only.json

{
    "version": "0.1",
    "test_p": 0,
    "external_reference_code": null,
    "remote_transaction_id": 1123,
    "service_provider_name": "b2binpay",
    "settings": {
        "redirect_url_success": "",
        "redirect_url_error": "",
        "payment_link_expiry_duration": 15,
        "expiry_duration_measurement_name": "seconds"
    },
    "payment_details": {
        "payable_amount": 190,
        "tip_amount": 0,
        "discount_amount": 10,
        "tax_amount": 0,
        "currency_name": "aed",
        "payment_method_name": "cryptocurrency"
    },
    "customer_details": {
        "external_customer_id": "1cc11",
        "first_name_en": null,
        "last_name_en": null,
        "email": "merchant_customer@gmail.com",
        "phone_nr": null,
        "customer_contact_method": "sms"
    },
    "employee_details": {
        "external_employee_id": "1ee11",
        "first_name_en": null,
        "last_name_en": null,
        "email": "merchant_employee@gmail.com",
        "phone_nr": null
    },
    "item_list": [
        {
            "external_item_id": 1,
            "display_name_en": "fries",
            "display_name_ar": "",
            "price": 100,
            "quantity": 1,
            "modifier_section_list": []
        },
        {
            "external_item_id": 2,
            "display_name_en": "sandwich",
            "display_name_ar": "",
            "price": 50,
            "quantity": 1,
            "modifier_section_list": []
        },
        {
            "external_item_id": 3,
            "display_name_en": "pepsi",
            "display_name_ar": "",
            "price": 50,
            "quantity": 1,
            "modifier_section_list": []
        }
    ],
    "offer_list": []
}